[
    { "id": 1, "title": "First Programmer", "content": "Ada Lovelace, a mathematician and writer, is often regarded as the world's first computer programmer. She created the first algorithm intended to be processed by a machine, specifically Charles Babbage's Analytical Engine, in the mid-19th century.." },
    { "id": 2, "title": "ENIAC and Its Female Programmers:", "content": "ENIAC (Electronic Numerical Integrator and Computer), one of the earliest electronic general-purpose computers, was programmed by a team of six women. Their contributions were often overlooked until recent years, highlighting the significant role women played in the early days of computing." },
    { "id": 3, "title": "The Bug", "content": "The term 'bug' to describe a flaw in a program originated in 1947 when Grace Hopper, an American computer scientist, found an actual moth causing a malfunction in the Mark II computer. She famously removed the moth and taped it into the computer's logbook, coining the term 'debugging.'" },
    { "id": 4, "title": "Lisp and Garbage Collection", "content": "Lisp, one of the oldest high-level programming languages still in use today, introduced the concept of automatic memory management through garbage collection. Developed in the late 1950s, Lisp's garbage collection mechanism allowed programmers to focus more on solving problems rather than managing memory explicitly, influencing the design of many subsequent programming languages." },
    { "id": 5, "title": "ASCII Art", "content": "ASCII art, a form of creating images using characters from the ASCII standard, was a precursor to modern emoji and graphic design on computers. It emerged in the early days of computing when graphical displays were not widely available, and programmers used text characters creatively to create images." },
    { "id": 6, "title": "WWW", "content": "Tim Berners-Lee, a British computer scientist, invented the World Wide Web in 1989 while working at CERN. He developed the first web browser and web server, laying the foundation for the modern internet as we know it today. Berners-Lee's invention revolutionized communication, information sharing, and collaboration on a global scale." },
    { "id": 7, "title": "Y2K Bug", "content": "As the year 2000 approached, there was widespread concern about the Y2K bug which stemmed from early programming practices where dates were often represented with only the last two digits of the year. This raised fears that computer systems would malfunction as they rolled over from 1999 to 2000. Extensive efforts were made to update and fix affected systems, leading to significant investment in software testing and debugging." }
]
  